posts/2015-07-05-between-love-and-hate.org

#+date: <2015-07-05>
#+filetags: prayer religion
#+title: Between Love and Hate


God of love and grace,

Before there was anything else,\\
there was love,\\
perfect and pure.

It was a love so full\\
that it manifested itself\\
in the creation of the infinite universe\\
in all of its beauty and diversity.

We rejoice today with those\\
who shed tears of joy\\
when, against all odds,\\
love won.

Our joy, though, is not yet complete,\\
as we grieve today with those\\
who shed tears of sorrow\\
when, as churches burned,\\
hate seemed to overcome.

But even now, as we stand\\
between the forces of hate\\
and the forces of love,\\
we will not despair,\\
for we know which side\\
you are on.\\

/Amen/


#+begin_tagline
Tagged: prayer religion
#+end_tagline
