docs/posts/2015-07-05-between-love-and-hate.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 08, 2025 05:11 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Between Love and Hate</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Between Love and Hate</h1>
<p class="subtitle" role="doc-subtitle">Jul 05, 2015 00:00</p>
</header><p>
God of love and grace,
</p>

<p>
Before there was anything else,<br>
there was love,<br>
perfect and pure.
</p>

<p>
It was a love so full<br>
that it manifested itself<br>
in the creation of the infinite universe<br>
in all of its beauty and diversity.
</p>

<p>
We rejoice today with those<br>
who shed tears of joy<br>
when, against all odds,<br>
love won.
</p>

<p>
Our joy, though, is not yet complete,<br>
as we grieve today with those<br>
who shed tears of sorrow<br>
when, as churches burned,<br>
hate seemed to overcome.
</p>

<p>
But even now, as we stand<br>
between the forces of hate<br>
and the forces of love,<br>
we will not despair,<br>
for we know which side<br>
you are on.<br>
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="orga6b5dbb">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 08, 2025 05:11.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
